import { profesori } from "./data/profesori";
import { predmeti } from "./data/predmeti";
import { casovi } from "./data/casovi";

export var raspored = {
	0: {},
	1: {
		1: [["филозофија", "Верољуб Илић", ""]],
		2: [["биологија", "Наталија Остојић", ""]],
		3: [["социологија", "Марина Вуковић Пантелић", ""]],
		4: [["одељенска", "Наташа Ђурић", ""]],
		5: [["физика", "Јасмина Ђокић Јовановић", ""]],
	},
	2: {
		1: [["српски", "Снежана Корнарос", ""]],
		2: [["физика", "Јасмина Ђокић Јовановић", ""]],
		3: [["физичко", "Момир Ђорђић", ""]],
		4: [["биологија", "Наталија Остојић", ""]],
		5: [["математика", "Зорица Бегуш", ""]],
	},
	3: {
		1: [["српски", "Снежана Корнарос", ""]],
		2: [["математика", "Зорица Бегуш", ""]],
		3: [
			["веб програмирање", "Наташа Ђурић", ""],
			["парадигме", "Ивана Фирауновић", ""],
		],
		4: [
			["веб програмирање", "Наташа Ђурић", ""],
			["парадигме", "Ивана Фирауновић", ""],
		],
		5: [["физичко", "Момир Ђорђић", ""]],
	},
	4: {
		1: [["физика", "Јасмина Ђокић Јовановић", ""]],
		2: [["математика", "Зорица Бегуш", ""]],
		3: [
			["веб програмирање", "Наташа Ђурић", ""],
			["парадигме", "Ивана Фирауновић", ""],
		],
		4: [
			["веб програмирање", "Наташа Ђурић", ""],
			["парадигме", "Владимир Нинковић", ""],
		],
		5: [["социологија", "Марина Вуковић Пантелић", ""]],
	},
	5: {
		1: [["математика", "Зорица Бегуш", ""]],
		2: [["енглески", "Зоран Протић", ""]],
		3: [["физика", "Јасмина Ђокић Јовановић", ""]],
		4: [
			["парадигме", "Ивана Фирауновић", ""],
			["базе података", "Владимир Нинковић", ""],
		],
		5: [["биологија", "Наталија Остојић", ""]],
	},
	6: {
		1: [["базе података", "Владимир Нинковић", ""]],
		2: [
			["парадигме", "Ивана Фирауновић", ""],
			["базе података", "Владимир Нинковић", ""],
		],
		3: [["филозофија", "Верољуб Илић", ""]],
		4: [["математика", "Зорица Бегуш", ""]],
		5: [["енглески", "Зоран Протић", ""]],
	},
	7: {
		2: [
			["парадигме", "Ивана Фирауновић", ""],
			["базе података", "Владимир Нинковић", ""],
		],
		3: [["српски", "Снежана Корнарос", ""]],
		4: [
			["веронаука", "Бошко Павловић", ""],
			["грађанско", "Марија Солдатовић", ""],
		],
		5: [["српски", "Снежана Корнарос", ""]],
	},
	8: {},
	9: {},
	10: {},
	11: {},
	12: {},
	13: {},
	14: {},
};

export function generateRaspored() {
	raspored = {
		0: {},
		1: {},
		2: {},
		3: {},
		4: {},
		5: {},
		6: {},
		7: {},
		8: {},
		9: {},
		10: {},
		11: {},
		12: {},
		13: {},
		14: {},
	};

	const key = "4/6";

	const value = casovi[key];

	// bad code
	// wtf is this?
	value.forEach((cas) => {
		const i = cas[0];
		const j = cas[1];
		const mod = cas[2];
		const dan = Math.floor((j - 2) / 14 - 0.01) + 1;
		var brojCasa = ((j - 3) % 14) + 1;

		let profesor = profesori[i];
		let predmet = predmeti[i];
		if (mod == "и") {
			predmet = "изборни";
		} else if (mod != "") {
			predmet = predmet + " (" + mod + ")";
		}
		if (dan in raspored[brojCasa]) {
			raspored[brojCasa][dan].push([predmet, profesor, ""]);
		} else {
			raspored[brojCasa][dan] = [[predmet, profesor, ""]];
		}
	});
}
